app/Controllers/Users.php

    public function register()
    {
        // Fetch request data.
        $userData = $this->request->getRawInput();
        $rules = [
            'name' => 'required|min_length[2]|max_length[50]',
            'email' => 'required|valid_email',
            'password' => 'required|regex_match[^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d!@#$%^&*]{6,}$]',
            'confirm_password'  => 'matches[password]'
        ];

        // Validate data.
        if (!$this->validateData($userData, $rules)) {
            return $this->response->setJSON($this->validator->getErrors());
        }

        // Check email duplicate.
        if ($this->model->userByEmail($userData['email']) != []) {
            return $this->response->setJSON(['Failed' => 'Email is already taken'], 400);
            // Save if all good.
        }

        // Hash password before store it in DB.
        $userData['password'] = password_hash($userData['password'], PASSWORD_DEFAULT);

        // Remove confirm_password from data.
        unset($userData['confirm_password']);

        // Store user.
        try {
            if ($this->model->insert($userData)) {
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('murtada', 'murt1111@gmail.com', '$2y$10$rtj1l5kprPHbIlItM0d5f.RfjBnnj2H8WM8aKh/WHikPD7TxOoKQy')