app/Models/BooksModel.php

SELECT `title`
FROM `books`
WHERE `title` = '2010'
---
    public function bookByTitle($title)
    {
        $bookTitle = $this->select('title')->where('title', $title)->find();

SELECT `id`, `price`
FROM `books`
WHERE `title` = '13 resoans why'
---
    public function bookByTitle2Cart($title)
    {
        $book = $this->select('id, price, quantity')->where('title', $title)->find();

SELECT `quantity`
FROM `books`
WHERE `books`.`id` = 2
---
    public function getBookQuantity($id)
    {
        try {
            $book = $this->select('quantity')->find($id);

UPDATE `books` SET `quantity` = '11'
WHERE `id` = 2
---
    public function updateQuantity($id, $quantity)
    {
        try {
            $this->where('id', $id)
                ->set('quantity', $quantity) // Update with the single value.
                ->update();

SELECT `id`, `title`, `author`, `genre`
FROM `books`
WHERE `title` LIKE '%Rings%' ESCAPE '!'
OR  `author` LIKE '%Rings%' ESCAPE '!'
OR  `genre` LIKE '%Rings%' ESCAPE '!'
---
    public function search($content)
    {
        try {
            $result = $this->select(['id', 'title', 'author', 'genre'])
                ->like('title', $content, 'i')
                ->orLike('author', $content, 'i')
                ->orLike('genre', $content, 'i')
                ->findAll();