app/Models/UsersModel.php

    public function userByEmail($email)
    {
        try {
            $email = $this->select('email')->where('email', $email)->find();
---
SELECT `email`
FROM `users`
WHERE `email` = 'murt1111@gmail.com'

    public function userDetailsByEmail($email)
    {
        $email = $this->select('*')->where('email', $email)->find();
---
SELECT *
FROM `users`
WHERE `email` = 'murt1111@gmail.com'